new_music_app/app/controllers/bands_controller.rb

    def destroy
        band = Band.find_by(id: params[:id])
        band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]